<template>
    <div id="agreement-text-block">
        <svg id="agreement-text-block-close" @click="$emit('close')" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 0 50 50" version="1.1" width="100%" height="100%">
            <g id="surface1">
                <path style=" " d="M 7.71875 6.28125 L 6.28125 7.71875 L 23.5625 25 L 6.28125 42.28125 L 7.71875 43.71875 L 25 26.4375 L 42.28125 43.71875 L 43.71875 42.28125 L 26.4375 25 L 43.71875 7.71875 L 42.28125 6.28125 L 25 23.5625 Z "></path>
            </g>
        </svg>
        <div class="agreement-text" data-tkey="agreementText"><h1>Пользовательское соглашение об оказании Услуги Wi-Fi</h1>
            <br>
            1. Термины и определения.<br>
            <br>
            1.1. Оператор — Оператор связи, предоставляющий Услугу под Товарным знаком «Oyster Telecom»<br>
            <br>
            1.2. Пользователь - Физическое лицо которое заключает Соглашение об оказании Услуги Wi-Fi с Оператором на настоящих Условиях.<br>
            <br>
            1.3. Cоглашение об оказании Услуги Wi-Fi (далее – Соглашение) — соглашение об оказании Услуги Wi-Fi, заключенное между Оператором и Пользователем на условиях настоящей Оферты в момент акцепта Пользователем её условий в порядке, определенном в разделе З настоящих Условий<br>
            <br>
            1.4. Услуга Wi-Fi (далее – Услуга) — услуга связи по предоставлению доступа к сети Интернет по технологии Wi-Fi при условии нахождении Пользователя в Зоне Обслуживания Оператора.<br>
            <br>
            1.5. Код подтверждения (пароль) – индивидуальный и уникальный идентификатор, предоставленный Пользователю при его аутентификации по абонентскому номеру, выделенному оператором подвижной связи, зарегистрированный на территории Российской Федерации и имеющий соответствующие лицензии в порядке, определенном настоящими Условиями, используемый для идентификации Пользователя Оператором.<br>
            <br>
            1.6. Зона обслуживания Оператора (Зона Wi-Fi Оператора) — территория (совокупность территорий), обслуживаемая точкой (точками) доступа Оператора, в пределах действия которой Пользователю предоставляется возможность воспользоваться Услугой.<br>
            <br>
            1.7. Квота пользования Услугой (далее – Квота) - установленная Оператором квота, определяющая количественные ограничения пользования Услугой за определенный период времени<br>
            <br>
            1.8. Технология Wi-Fi — формат передачи цифровых данных, обеспечивающий беспроводное подключение пользовательского устройства к сети Интернет по протоколу IЕЕЕ 802.11 b/g.<br>
            <br>
            2. Предмет.<br>
            <br>
            2.1. В период действия Соглашения Оператор обязуется оказывать Пользователю Услугу.<br>
            <br>
            2.2. Оператор оказывает Услугу на основании лицензий, выданных Федеральной службой по надзору в сфере связи, информационных технологий и массовых коммуникаций.<br>
            <br>
            3. Порядок заключения договора<br>
            <br>
            3.1. Настоящая Оферта адресована физическим лицам (гражданам), желающим воспользоваться Услугой.<br>
            <br>
            3.2. Для доступа в сеть Интернет с использованием Услуги Пользователю необходимо выбрать при помощи Абонентского устройства соответствующую точку доступа.<br>
            <br>
            3.3. Соглашение заключается путем акцепта настоящих Условий Пользователем.<br>
            <br>
            3.4. Акцептом настоящей Оферты является факт указания Пользователем абонентского номера на Сайте Услуги и и его регистрации у Оператора.<br>
            <br>
            3.5. После регистрации абонентского номера на указанный абонентский номер Оператор направляет SMS-сообщение с Кодом подтверждения, который Пользователь должен ввести на Сайте Услуги.<br>
            <br>
            3.6. Для того, чтобы воспользоваться Услугой Пользователь должен ввести на Сайте Услуги Код подтверждения (пароль).<br>
            <br>
            3.7. Отсчёт времени пользования Услугой согласно заказанной Квоте начинается с момента регистрации Пользователя в сети Оператора с использованием технологии Wi-Fi и не зависит от фактического времени пользования Услугой.<br>
            <br>
            3.8. Заключая Соглашение в порядке, предусмотренном настоящими Условиями, Пользователь соглашается на весь срок действия Соглашения на получение рекламы Оператора и/или третьих лиц при использовании Услуг.<br>
            <br>
            4. Обязанности и права Пользователя.<br>
            <br>
            4.1. Пользователь обязуется использовать Абонентское устройство, которое соответствует установленным законодательством Российской Федерации требованиям.<br>
            <br>
            4.2. Пользователь обязуется содержать Абонентское устройство в исправном состоянии, а также соблюдать правила эксплуатации Абонентского устройства при пользовании Услугой.<br>
            <br>
            4.3. Пользователь обязуется предпринимать меры по защите Абонентского устройства от воздействия вредоносного программного обеспечения.<br>
            <br>
            4.4. Пользователь обязуется не распространять, а также препятствовать распространению спама и вредоносного программного обеспечения с его Абонентского устройства, соблюдать права и интересы Оператора, других Пользователей и пользователей сетей связи, в том числе:<br>
            1) не использовать Услугу для массовой или одиночной рассылки не согласованных предварительно с адресатом электронных писем рекламного, коммерческого или агитационного характера, а также писем, содержащих грубые и оскорбительные выражения и предложения. Под массовой рассылкой подразумевается, как рассылка множеству получателей, так и множественная рассылка одному получателю;<br>
            2) не рассылать информацию получателям, высказавшим ранее явное нежелание получать эту информацию;<br>
            3) не размещать в любой конференции, форуме или электронном списке рассылки статьи и сообщения, которые не соответствуют тематике данной конференции или списка рассылки, если это не соответствует правилам такой конференции или форума;<br>
            4) не распространять угрожающую, клеветническую или непристойную информацию, или информацию, которая может быть воспринята как оскорбительная. В частности, не распространять порнографию, информацию, задевающую национальные или религиозные чувства, содержащую нецензурные слова или призывы к насилию;<br>
            5) не распространять информацию, программы для ЭВМ и иные результаты интеллектуальной деятельности без разрешения правообладателя или его полномочного представителя;<br>
            6) не допускать действий, направленных на нарушение нормального функционирования элементов сети (компьютеров, другого оборудования или программного обеспечения), не принадлежащих Пользователю, в том числе не осуществлять действия с целью изменения настроек оборудования или программного обеспечения Оператора;<br>
            7) не допускать действий, направленных на получение несанкционированного доступа, в том числе привилегированного, к ресурсам сети (компьютеру, любому оборудованию или информационному ресурсу) и не использовать такой доступ;<br>
            8) не передавать компьютерам или оборудованию сети бессмысленную или бесполезную информацию, создающую неоправданно высокую нагрузку на эти компьютеры или оборудование, а также на промежуточные участки сети, в объемах, превышающих минимально необходимые для проверки связности сетей и доступности отдельных ее элементов;<br>
            9) соблюдать правила использования любого информационного или технического ресурса сети либо немедленно отказаться от его использования. Правила использования ресурсов либо ссылка на них публикуются владельцами или администраторами этих ресурсов в точке подключения к таким ресурсам и являются обязательными к исполнению всеми пользователями этих ресурсов;<br>
            10) не использовать идентификационные данные (имена, адреса, телефоны и тп.) третьих лиц, кроме случаев, когда эти лица уполномочили Пользователя на такое использование. В то же время Пользователь должен принять меры по предотвращению использования ресурсов сети третьими лицами от его имени (обеспечить сохранность Логина и пароля);<br>
            11) не фальсифицировать свой IР-адрес, а также адреса, используемые в других сетевых протоколах, при передаче данных в сеть;<br>
            12) не использовать несуществующие обратные адреса при отправке электронной корреспонденции;<br>
            13) принять надлежащие меры по такой настройке своих ресурсов, которая бы препятствовала недобросовестному использованию этих ресурсов третьими лицами, а также оперативно реагировать при обнаружении случаев такого использования (открытый ретранслятор электронной почты; открытые прокси-серверы; общедоступные широковещательные адреса локальных сетей и др.);<br>
            14) не создавать угрозу безопасности и обороноспособности Российской Федерации, здоровью и безопасности людей;<br>
            15) не использовать Услугу для пропуска исходящего трафика от иных операторов связи и сетей связи;<br>
            16) принять надлежащие меры по такой настройке своего Абонентского устройства, которая препятствовала бы недобросовестному использованию этих ресурсов третьими лицами, а также оперативно реагировать при обнаружении случаев такого использования;<br>
            <br>
            4.5. Пользователь обязуется регулярно проверять наличие изменений и дополнений в порядке предоставления Услуги.<br>
            <br>
            5. Прекращение оказания Услуги.<br>
            <br>
            5.1. Соглашение прекращает свое действие с момента исчерпания Квоты. С момента прекращения действия Соглашения Услуга Пользователю не оказывается.<br>
            <br>
            5.2. В случае нарушения Пользователем законодательства Российской Федерации и настоящих Условий, Оператор оставляет за собой право приостановить оказание Услуги Пользователю до устранения нарушения и взыскать с Пользователя все причиненные Оператору таким нарушением убытки.<br>
            <br>
            6. Ответственность Сторон.<br>
            <br>
            6.1. Стороны несут ответственность за неисполнение или ненадлежащее исполнение своих обязательств в соответствии с действующим законодательством Российской Федерации.<br>
            <br>
            6.2. Пользователь согласен с тем, что Оператор не несет ответственности:<br>
            <br>
            6.2.1. за информацию, услуги, программное обеспечение, самостоятельно полученные Пользователем через сеть Интернет;<br>
            <br>
            6.2.2. за любые затраты или ущерб, прямо или косвенно возникшие в результате получения Пользователем информации и услуг через сеть Интернет;<br>
            <br>
            6.2.3. за ущерб, нанесенный Пользователю в результате действия программных продуктов, полученных Пользователем посредством Услуги;<br>
            <br>
            6.2.4. за прямой или косвенный ущерб, причиненный Пользователю в результате использования или невозможности использования Услуги не по вине Оператора;<br>
            <br>
            6.2.5. качество оказываемой Услуги в случаях использования Пользователем несертифицированного Абонентского устройства, а также при неправильной настройке Абонентского устройства, включая программное и техническое обеспечения доступа к Услуге;<br>
            <br>
            6.2.6. за нормальное функционирование и доступность отдельных сегментов сети Интернет;<br>
            <br>
            6.3. Оператор не гарантирует:<br>
            <br>
            6.3.1. возможность информационного обмена с теми узлами или серверами, которые временно или постоянно недоступны через сеть Интернет;<br>
            <br>
            6.3.2. абсолютную бесперебойность доступа к Услуге;<br>
            <br>
            6.3.3. установление соединения с сетью Интернет на максимально возможной скорости;<br>
            <br>
            6.4. Пользователь надлежащим образом информирован о том, что оказываемая Услуга из-за характера распространения радиоволн и конструктивных особенностей сети связи может ухудшаться, прерываться или подвергаться помехам вблизи источников радиоизлучения, электрических приборов, из-за архитектурных особенностей зданий и т. п. Пользователь согласен с тем, что не будет иметь претензий к Оператору в подобных случаях.<br>
            <br>
            6.5. Пользователь несет полную ответственность за все обращения к Услуге и действия, предпринятые через обращение к Услуге, имевшие место при введении пароля, выделенных Пользователю.<br>
            <br>
            6.6. Пользователь обязуется самостоятельно (своими силами и за свой счет) урегулировать претензии третьих лиц, вызванные нарушением Пользователем п. 6.4. настоящих Условий, и нести ответственность перед третьими лицами или Оператором за каждый факт подобного нарушения.<br>
            <br>
            7. Заключительные положения.<br>
            <br>
            7.1. Соглашение, заключенное на настоящих условиях, действует с момента совершения Пользователем акцепта настоящей Оферты в порядке, установленным пунктом 3.3 настоящих Условий, до момента исчерпания Квоты, или до завершения сессии по инициативе Пользователя.<br>
            <br>
            7.2. Выполнив действия, указанные в п. 3.4. настоящих Условий, Пользователь подтверждает, что ознакомлен и согласен с условиями настоящей Оферты, тарифами на Услуги связи, Зоной Wi-Fi Оператора.<br>
            <br>
        </div>
    </div>
</template>

<script>
    export default {
        name: "agreement"
    }
</script>

<style scoped>
    #agreement-text-block {
        background: #ffffff;
        color: #000000;
        position: static;
        top: 0;
        right: 0;
        left: 0;
        width: 100%;
        height: auto;
        z-index: 4;
    }
    #agreement-text-block-close {
        width: 30px;
        height: 30px;
        position: fixed;
        top: 5px;
        right: 0;
        margin-right: 3px;
        cursor: pointer;
        fill: #000 !important;
    }
    .agreement-text {
        text-align: justify;
        padding: 5px 30px 0 10px;
    }
</style>
